export const paramsNameEnum = {
    '0': '祛痘祛斑',
    '4': '亮眼',
    '8': '阴影',
    '9': '高光',
    '108': '白牙',
    '200': '瘦脸',
    '201': '眼睛-大小',
    '202': '发际线',
    '203': '鼻子-大小',
    '204': '颧骨',
    '205': '下巴',
    '206': '眼睛-高度',
    '207': '眼睛-距离',
    '208': '眼睛-倾斜',
    '209': '鼻子-高度',
    '210': '鼻子-鼻梁',
    '211': '鼻子-鼻翼',
    '212': '鼻子-鼻尖',
    '213': '嘴巴-大小',
    '214': '嘴巴-高度',
    '215': '嘴巴-上唇',
    '216': '嘴巴-下唇',
    '217': '眉毛-粗细',
    '218': '眉毛-位置',
    '219': '眉毛-距离',
    '220': '眉毛-倾斜',
    '221': '眉毛-形状',
    '222': '小头',
    '223': '脸宽',
    '224': '嘴巴-宽度',
    '225': '眼睛-宽度',
    '226': '眼睛-位置',
    '227': '太阳穴',
    '228': '下颌',
    '230': '小脸',
    '300': '滤镜',
    '3000': '曝光',
    '3002': '对比度',
    '3003': '高光',
    '3004': '阴影',
    '3007': '色温',
    '3008': '色调',
    '3011': 'HSL 色相',
    '3012': 'HSL 饱和度',
    '3013': 'HSL 明度',
    '3020': '白色',
    '3021': '黑色',
    '90001': '质感磨皮（中性灰）',
    '90002': '磨皮',
    '90003': '肤色统一',
    '90004': '肤色透亮',
    '90005': '肤色美白',
    '90007': '肤色红润',
    '5': '淡化黑眼圈',
    '6': '祛法令纹',

    // 全身美型
    400: '瘦手臂',
    401: '瘦腰',
    402: '瘦腿',
    403: '丰胸',
    404: '美臀',
    405: '瘦身',
    406: '头部',
    407: '长腿'
}

export const personTypeNameEnum = {
    Female: '女',  // 女性
    Male: '男',    // 男性
    Child: '儿童',    // 小孩
    Older: '长辈'    // 长辈
}

export const colorNameEnum = {
    Red: '红',         // 红
    Orange: '橙',      // 橙
    Yellow: '黄',      // 黄
    Green: '绿',       // 绿
    Cyan: '青',        // 青（浅绿色）
    Blue: '蓝',        // 蓝
    Purple: '紫色',    // 紫色
    Magenta: '洋红'   // 洋红
}
